exercises/vortexMerge_icoFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         40;

deltaT          0.005;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions    // sub-dictionary name under the system/controlDict file
{
    omegaVector
    {
        // Mandatory entries (unmodifiable)
        type        vorticity;
        libs        (fieldFunctionObjects);
        
        // Optional (inherited) entries
        field           U;
        result          omegaVector;
        
        writeControl    timeStep;
        writeInterval   100;
    }
    
    psiPoint
    {
        // Mandatory entries (unmodifiable)
        type        streamFunction;
        libs        (fieldFunctionObjects);
        
        // Optional (inherited) entries
        field           phi;
        result          psiPoint;
        writeFields     true;
        
        writeControl    timeStep;
        writeInterval   100;
    }
}

// ************************************************************************* //
