exercises/vortexMerge_icoFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
65536
(
(0.000684563 -0.000684505 0)
(0.00205355 -0.000684361 0)
(0.00342204 -0.000683981 0)
(0.00478947 -0.000683325 0)
(0.00615533 -0.000682427 0)
(0.00751916 -0.000681314 0)
(0.00888056 -0.00068001 0)
(0.0102392 -0.000678543 0)
...
)
;


boundaryField
{
    singlePatch
    {
        type            slip;
        //value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
