exercises/vortexMerge_icoFoam/0/omegaVector
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      omegaVector;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
65536
(
(0 -0 1.1414e-06)
(0 -0 6.4e-06)
(0 -0 1.56127e-05)
(0 -0 2.57631e-05)
(0 -0 3.48739e-05)
(0 -0 4.29452e-05)
(0 -0 4.97529e-05)
(0 -0 5.64178e-05)
...
)
;

boundaryField
{
    singlePatch
    {
        type            calculated;
        value           nonuniform List<vector> 
1024
(
(0 -0 -1.97707e-05)
(0 -0 -3.75439e-05)
(0 -0 -2.5172e-05)
(0 -0 2.54777e-06)
(0 -0 4.48408e-05)
(0 -0 0.000100688)
(0 -0 0.000163954)
(0 -0 0.00022451)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
