exercises/vortexMerge_icoFoam/system/expressionsDict
expressions 
(
 	omega sin(x);
);
